FILES/InformationRegisters/ОписаниеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширенныйОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ОписаниеНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступныеЗначения.Параметры.УстановитьЗначениеПараметра("Ссылка",Запись.НоменклатураБТ);
	
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Партнер",Запись.Партнер);
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Контрагент",Запись.Контрагент);
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Договор",Запись.Договор);
КонецПроцедуры


&НаСервере
Процедура ДоступныеЗначенияВыборНаСервере(Характеристика)
	
	Префикс = "";
	Если ТипЗнч(Характеристика) = Тип("СправочникСсылка.ФункцииОписания") Тогда
		ИмяХарактеристики = Характеристика.КлючПоиска;
		Префикс = "f";
 	ИначеЕсли ТипЗнч(Характеристика) = Тип("ПланВидовХарактеристикСсылка.НаборХарактеристикДляЭкстраПолей") Тогда
		ИмяХарактеристики = Характеристика.КлючПоиска;
	Иначе
		ИмяХарактеристики = Характеристика.КлючПоиска;
	КонецЕсли;
	
	НС = 0;
	НК = 0;
	КС = 0;
	КК = 0;
	Элементы.ШаблонОписания.ПолучитьГраницыВыделения(НС,НК,КС,КК);

	ШаблонОписания = Сред(Запись.ШаблонОписания,0,НК-1) + Префикс+"["+ИмяХарактеристики+"]" + Сред(Запись.ШаблонОписания,КК, СтрДлина(Запись.ШаблонОписания));
	
	Запись.ШаблонОписания = ШаблонОписания;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Характеристика = Элемент.ТекущиеДанные.Характеристика;
		ДоступныеЗначенияВыборНаСервере(Характеристика);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеФункцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Характеристика = Элемент.ТекущиеДанные.Ссылка;
		ДоступныеЗначенияВыборНаСервере(Характеристика);
	КонецЕсли;
КонецПроцедуры
